docs/reports/audit/WO-0084-mutations/class-01-preamble-txc.diff
diff --git a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
--- a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
+++ b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
@@ -133,7 +133,7 @@
        if k = 0
        then of_int ~width:8 start_char, vdd
        else if k = 7
-       then of_int ~width:8 sfd_char, gnd
+       then of_int ~width:8 sfd_char, vdd
        else of_int ~width:8 preamble_filler, gnd))
 ;;
 
