docs/reports/audit/WO-0084-mutations/class-02-frame-lane-reversal.diff
diff --git a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
--- a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
+++ b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
@@ -277,7 +277,7 @@
          let octet =
            mux2
              is_payload
-             (select held_data ((8 * j) + 7) (8 * j))
+             (select held_data ((8 * (7 - j)) + 7) (8 * (7 - j)))
              (mux2
                 is_pad
                 (zero 8)
