docs/reports/audit/WO-0084-mutations/class-05-pad-value-nonzero.diff
diff --git a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
--- a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
+++ b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
@@ -280,7 +280,7 @@
              (select held_data ((8 * j) + 7) (8 * j))
              (mux2
                 is_pad
-                (zero 8)
+                (ones 8)
                 (mux2
                    is_fcs
                    fcs_octet
