docs/reports/audit/WO-0084-mutations/class-07-fcs-byte-reversed.diff
diff --git a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
--- a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
+++ b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
@@ -263,7 +263,7 @@
      first, which is the ordering that makes REQ-304's residue constant and is
      therefore the same decision M03's check depends on. *)
   let fcs_octets =
-    List.init 4 ~f:(fun k -> select fcs_value ((8 * k) + 7) (8 * k))
+    List.init 4 ~f:(fun k -> select fcs_value ((8 * (3 - k)) + 7) (8 * (3 - k)))
   in
   let body_word =
     word_of_lanes
