docs/reports/audit/WO-0084-mutations/class-08-terminate-lane-late.diff
diff --git a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
--- a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
+++ b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
@@ -272,7 +272,7 @@
          let is_payload = j_s <+ d_payload in
          let is_pad = (j_s >=+ d_payload) &: (j_s <+ d_pad) in
          let is_fcs = (j_s >=+ d_pad) &: (j_s <+ d_term) in
-         let is_term = j_s ==: d_term in
+         let is_term = j_s ==: (d_term +:. 1) in
          let fcs_octet = mux (uresize (j_s -: d_pad) 2) fcs_octets in
          let octet =
            mux2
