docs/reports/audit/WO-0084-mutations/class-09-idle-fill-value.diff
diff --git a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
--- a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
+++ b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
@@ -284,7 +284,7 @@
                 (mux2
                    is_fcs
                    fcs_octet
-                   (mux2 is_term (of_int ~width:8 terminate_char) (of_int ~width:8 idle_char))))
+                   (mux2 is_term (of_int ~width:8 terminate_char) (of_int ~width:8 0))))
          in
          octet, ~:(is_payload |: is_pad |: is_fcs)))
   in
