docs/reports/audit/WO-0084-mutations/class-10-gap-no-roundup.diff
diff --git a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
--- a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
+++ b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
@@ -296,7 +296,7 @@
      no gap is ever shortened. *)
   let gap_left = wire 6 in
   let gap_words terminate_lane =
-    let sum = uresize i.cfg_ifg 10 +: uresize terminate_lane 10 +:. 7 in
+    let sum = uresize i.cfg_ifg 10 +: uresize terminate_lane 10 +:. 0 in
     uresize (srl sum 3) 6
   in
   let term_here = in_body &: (d_term >=+. 0) &: (d_term <=+. 7) in
