docs/reports/audit/WO-0084-mutations/class-13-abort-word-swapped.diff
diff --git a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
--- a/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
+++ b/libs/hardcaml_ethernet/src/xgmii_tx_64.ml
@@ -146,9 +146,9 @@
   word_of_lanes
     (List.init 8 ~f:(fun k ->
        if k = 0
+       then of_int ~width:8 terminate_char, vdd
+       else if k = 1
        then of_int ~width:8 error_char, vdd
-       else if k = 1
-       then of_int ~width:8 terminate_char, vdd
        else of_int ~width:8 idle_char, vdd))
 ;;
 
